markusjellitsch/Helio/Sources/Slaves/stm32_vldisco.cpp
//------------------------------------------------------------------------
// NAME         : stm32_vldisco.cpp
// AUTHOR       : Markus Jellitsch
// DATE         : 6.02.2018
// DESCRIPTION  : This is the implementation of the RTU which are connected via
//                SPI to the Raspberry Pi. The RTU is able to generate PWM signal,
//                count frequency and has other functionality.
// -----------------------------------------------------------------------

#include "stm32_vldisco.h"
#include "wiringPi.h"
#include "Modbus/holdingregister.h"
#include "Logger/logger.h"
#include "Modbus/modbusrtu.h"
#include <string>
#include <iostream>
#include <cassert>
#include <iomanip>
#include <ctime>


using namespace std;

/*---------------------------------------------------------------------------
 * Constructor. Initialize holding registers and set SPI interface
 *--------------------------------------------------------------------------*/
STM32_VLDISCO::STM32_VLDISCO(SPIRPi * interface){

    mSPIInterface = interface;
    // config raspi pins with wiringPi library
    wiringPiSetup();
    pinMode(SPI_SLAVE_DRY_PIN,INPUT);
    pinMode(SPI_SLAVE_CS_PIN,OUTPUT);

    mHoldingRegisters = new ModbusHoldingRegister(RTU_NUM_HOLDING_REGISTER);
    assert(mHoldingRegisters != nullptr);

    // set default description
    mHoldingRegisters->setDescription(RTU_SYS_CR1,RTU_REG_DESC_SYS_CR1);
    mHoldingRegisters->setDescription(RTU_SYS_EN,RTU_REG_DESC_SYS_EN);
    mHoldingRegisters->setDescription(RTU_SYS_SR,RTU_REG_DESC_SYS_SR);
    mHoldingRegisters->setDescription(RTU_SYS_BOOT,RTU_REG_DESC_SYS_BOOT);
    mHoldingRegisters->setDescription(RTU_PWM_CR,RTU_REG_DESC_PWM_CR);
    mHoldingRegisters->setDescription(RTU_PWM_SR,RTU_REG_DESC_PWM_SR);
    mHoldingRegisters->setDescription(RTU_PWM_CNT,RTU_REG_DESC_PWM_CNT);
    mHoldingRegisters->setDescription(RTU_PWM_PRD,RTU_REG_DESC_PWM_PRD);
    mHoldingRegisters->setDescription(RTU_PWM_PSC,RTU_REG_DESC_PWM_PSC);
    mHoldingRegisters->setDescription(RTU_PWM_DUT,RTU_REG_DESC_PWM_DUT);
    mHoldingRegisters->setDescription(RTU_CNT_PRD,RTU_REG_DESC_CNT_PRD);
    mHoldingRegisters->setDescription(RTU_CNT_SR,RTU_REG_DESC_CNT_SR);
    mHoldingRegisters->setDescription(RTU_CNT_CH1,RTU_REG_DESC_CNT_CH1);
    mHoldingRegisters->setDescription(RTU_CNT_CH2,RTU_REG_DESC_CNT_CH2);
    mHoldingRegisters->setDescription(RTU_CNT_CH3,RTU_REG_DESC_CNT_CH3);
    mHoldingRegisters->setDescription(RTU_CNT_CH4,RTU_REG_DESC_CNT_CH4);
    mHoldingRegisters->setDescription(RTU_CNT_RES,RTU_REG_DESC_CNT_RES);

   // set default name
    mHoldingRegisters->setName(RTU_SYS_CR1,RTU_REG_NAME_SYS_CR1);
    mHoldingRegisters->setName(RTU_SYS_EN,RTU_REG_NAME_SYS_EN);
    mHoldingRegisters->setName(RTU_SYS_SR,RTU_REG_NAME_SYS_SR);
    mHoldingRegisters->setName(RTU_SYS_BOOT,RTU_REG_NAME_SYS_BOOT);
    mHoldingRegisters->setName(RTU_PWM_CR,RTU_REG_NAME_PWM_CR);
    mHoldingRegisters->setName(RTU_PWM_SR,RTU_REG_NAME_PWM_SR);
    mHoldingRegisters->setName(RTU_PWM_CNT,RTU_REG_NAME_PWM_CNT);
    mHoldingRegisters->setName(RTU_PWM_PRD,RTU_REG_NAME_PWM_PRD);
    mHoldingRegisters->setName(RTU_PWM_PSC,RTU_REG_NAME_PWM_PSC);
    mHoldingRegisters->setName(RTU_PWM_DUT,RTU_REG_NAME_PWM_DUT);
    mHoldingRegisters->setName(RTU_CNT_PRD,RTU_REG_NAME_CNT_PRD);
    mHoldingRegisters->setName(RTU_CNT_SR,RTU_REG_NAME_CNT_SR);
    mHoldingRegisters->setName(RTU_CNT_CH1,RTU_REG_NAME_CNT_CH1);
    mHoldingRegisters->setName(RTU_CNT_CH2,RTU_REG_NAME_CNT_CH2);
    mHoldingRegisters->setName(RTU_CNT_CH3,RTU_REG_NAME_CNT_CH3);
    mHoldingRegisters->setName(RTU_CNT_CH4,RTU_REG_NAME_CNT_CH4);
    mHoldingRegisters->setName(RTU_CNT_RES,RTU_REG_NAME_CNT_RES);

    mStatistic.commandsSent = 0;
    mStatistic.errorsOccured = 0;
    mStatistic.timeoutsOccured = 0;
    mStatistic.responsesReceived = 0;

    mStopwatchCounter = -1;

    mLogger = nullptr;
}

STM32_VLDISCO::~STM32_VLDISCO(){

    delete mHoldingRegisters;
    mLogger = nullptr;
    mStopwatchCounter = -1;
}

/*---------------------------------------------------------------------------
 * Connect to RTU by reading a special register. This register must contain
 * a specified value. Otherwise connection goes wrong
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::connect(){

    int error = updateRegisters();
    RTUASSERT(error);

    error = compareRegisterValue(RTU_SYS_BOOT,RTU_SYS_BOOT_SEQUENCE);
    RTUASSERT(error);

    RTUASSERT(writeSingleRegister(RTU_SYS_EN,0));
    RTUASSERT(writeSingleRegister(RTU_PWM_SR,0));

    log(RTU_NOTE,"RTU initialization successful!");

    return RTU_OK;
}

/*---------------------------------------------------------------------------
 * Testing SPI performance between RTU and Raspberry Pi
 *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::testPerformance(unsigned int const  readCount, unsigned int const writeCount){

     int error = 0;
     int16_t value = 0;

     // testing command read holding
     log(RTU_NOTE,"Reading Holding Register Test!");
     for (unsigned int i = 0; i < readCount;i++){
        error = readSingleRegister(RTU_SYS_BOOT,&value);
        RTUASSERT(error);
        compareRegisterValue(RTU_SYS_BOOT,RTU_SYS_BOOT_SEQUENCE,false);

     }

    // testing command write holding
    log(RTU_NOTE,"Write Holding Register Test!");
    for (unsigned int i = 0;i<writeCount;i++){
         error = writeSingleRegister(RTU_SYS_CR1,0);
         RTUASSERT(error);
     }

    // print statistic
    printStatistic();

    return RTU_OK;
 }

/*---------------------------------------------------------------------------
 * Set Logger for logging events
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::setLogger(Logger * const logger){

    mLogger = logger;
    RTUASSERT(mLogger == nullptr);

    return RTU_OK;
}

/*---------------------------------------------------------------------------
 * Log event (e.g to std:out or a file)
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::log(uint8_t const logLevel,std::string const & text){


    if (mLogger == nullptr) return RTU_ERROR_NULLPTR;

    switch (logLevel){

