markusjellitsch/Helio/Sources/Slaves/stm32_vldisco.cpp
        case RTU_ERROR:
            mLogger->Error(text);
            break;

         case RTU_NOTE:
             mLogger->Note(text);
             break;

         default:
             break;

     }


    return RTU_OK;
}


/*---------------------------------------------------------------------------
 * SPI transaction to the RTU. This function transmits specified data and
 * return slave response back. This is the base function for a communication
 * between Raspberry Pi and RTU.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::transaction(uint8_t * txData, unsigned int txLen,uint8_t * rxData,unsigned int * rxLen){


    // set slave select low
    digitalWrite(SPI_SLAVE_CS_PIN,0);

    // write data len as very first byte
    uint8_t len_byte =  (uint8_t)(txLen);
    int error = mSPIInterface->writeMulti(0,&len_byte,1);
    if (error != I_OK){
        log(RTU_ERROR,"Writing to SPI failed!");
        return RTU_ERROR_SPI_WRITE_FAILED;
    }

    // transmit data
    error = mSPIInterface->writeMulti(0,txData,txLen);
    if (error != I_OK){
        log(RTU_ERROR,"Writing to SPI failed!");
        return RTU_ERROR_SPI_WRITE_FAILED;
    }

     mStatistic.commandsSent++;

    bool timeout = 0;

    // start timer
    uint64_t start = getTime();

    // wait for stm32 to raise DATA READY line
    while (digitalRead(SPI_SLAVE_DRY_PIN)!=1){

        double elapsed = (getTime()-start)/1000000;
        if (elapsed >= RTU_DRY_TIMEOUT_MS) {
           timeout = true;
           break;
        }
    }


    // on timeout reset CS line & return
    if (timeout){
        log(RTU_ERROR,"DRY timeout occured!");
        // reset slave select
        digitalWrite(SPI_SLAVE_CS_PIN,1);
        mStatistic.timeoutsOccured++;
        return RTU_ERROR_SPI_DRY_TIMEOUT;
   }

    // read first byte from stm32 to get data len
    error =  mSPIInterface->readMulti(0,rxData,1);
    if (error != I_OK){
        mStatistic.errorsOccured++;
        log(RTU_ERROR,"Reading from SPI (first byte) failed!");
        return RTU_ERROR_SPI_READ_FAILED;
    }

    // read rest bytes
    uint16_t len = rxData[0];
    error =  mSPIInterface->readMulti(0,rxData,len);
    if (error != I_OK){
        mStatistic.errorsOccured++;
        log(RTU_ERROR,"Reading from SPI (payload bytes) failed!");
        return RTU_ERROR_SPI_READ_FAILED;
    }


    // reset slave select
    digitalWrite(SPI_SLAVE_CS_PIN,1);

    log(RTU_NOTE,"SPI transaction OK!");

    *rxLen = len;

    // return total data read
    return RTU_OK;
}

/*---------------------------------------------------------------------------
 * SPI transaction to the RTU. This function transmits specified data and
 * return slave response back. This is the base function for a communication
 * between Raspberry Pi and RTU.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::transaction(ModbusFrame_t & send, ModbusFrame_t * receive){

      uint8_t const cNumBytes = 255;
      uint8_t dataSend[cNumBytes] = {0};
      uint8_t dataReceive[cNumBytes] = {0};


      // prepare data frame
      int index = 0;
      dataSend[index++] = send.slaveAddress;
      dataSend[index++] = send.functionCode;
      for (int i = 0; i< send.dataLen;i++){
           dataSend[index +i] = send.data[i];

       }
       index+=send.dataLen;
       dataSend[index++] = send.crcLow;
       dataSend[index++] = send.crcHigh;


       if (receive == nullptr) return RTU_ERROR_NULLPTR;

       unsigned int numBytes = 0;

       int error = transaction(dataSend,index,dataReceive,&numBytes);
       RTUASSERT(error);


       ModbusRTU response;
       response.setPayloadSize(receive->dataLen);

       // parse response frame to be valid
       if(response.parseData(dataReceive,numBytes)){
           response.getFrame(receive);
           mStatistic.responsesReceived++;
           return RTU_OK;
       }

       mStatistic.errorsOccured++;

       log(RTU_ERROR,"Invalid Response Packet received!");

       return RTU_ERROR_INVALID_PACKET;
}


/*---------------------------------------------------------------------------
 * Write a single register of the RTU's internal registers. Note that some
 * internal registers can be marked as read only. Therfore this register can not
 * be written and this function won't return RTU_OK
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::writeSingleRegister(uint8_t const reg, int16_t const value){

     uint8_t const cNumBytes = 4;
     uint8_t data[cNumBytes] = {0x0};
     data[1] = reg;
     data[2] = (uint8_t)(value >> 8);
     data[3] = (uint8_t)(value & 0xFF);

     ModbusRTU modbus;
     ModbusFrame_t responseFrame;
     responseFrame.dataLen = cNumBytes;

     // create spi frame
     ModbusFrame_t sendFrame = modbus.createFrame(RTU_ADDRESS,MODBUS_FUNC_WRITESINGLE,data,cNumBytes);

     int error = transaction(sendFrame,&responseFrame);

    string text = "Write Single Register " + to_string(reg);

    if (error == RTU_OK){
        log(RTU_NOTE,text + " OK!");
    }
    else {
        log(RTU_ERROR,text + + " NOK!");
    }


     return error;
 }

/*---------------------------------------------------------------------------
 * Read a single register of the RTU's internal registers.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::readSingleRegister(uint8_t const reg,int16_t * value){

     uint8_t const cNumBytes = 4;
     uint8_t data[cNumBytes] = {0x0};
     data[1] = reg;
     data[2] = 0x00;
     data[3] = 0x01;

     // response frame
     ModbusRTU modbus;
     ModbusFrame_t responseFrame;
     responseFrame.dataLen = 3;

     // create spi frame
     ModbusFrame_t sendFrame = modbus.createFrame(RTU_ADDRESS,MODBUS_FUNC_READHOLDING,data,cNumBytes);

     string text = "Reading Single Register " + reg;

     int error = transaction(sendFrame,&responseFrame);
     if (error == RTU_OK){

         *value = (int16_t)(responseFrame.data[1]<< 8) | responseFrame.data[2];

         // update internal holding reg
         mHoldingRegisters->setValue(reg,*value);

         log(RTU_NOTE,text + " OK!");

