markusjellitsch/Helio/Sources/Slaves/stm32_vldisco.cpp
     }
     else  log(RTU_ERROR,text + " NOK!");

     return error;
}


/*---------------------------------------------------------------------------
 * Read multiple registers of the RTU' internal registers.
 *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::readMultiRegister(uint8_t const reg,uint8_t const num, ModbusHoldingRegister * holdings){

     uint8_t const cNumBytes = 4;
     uint8_t data[cNumBytes] = {0x0};
     data[1] = reg;
     data[2] = 0x00;
     data[3] = num;

     ModbusRTU modbus;
     ModbusFrame_t responseFrame;
     responseFrame.dataLen = 1+num*2;

     ModbusFrame_t sendFrame = modbus.createFrame(RTU_ADDRESS,MODBUS_FUNC_READHOLDING,data,cNumBytes);

     int error = transaction(sendFrame,&responseFrame);

     string text = "Reading Multi Register " + num;

     if (error == RTU_OK){

         for (int i = 0; i<num;i++){
             holdings->setValue(reg+i,(int16_t)(responseFrame.data[2*i+1]<< 8) | responseFrame.data[2*i+2]);
         }

         log(RTU_NOTE,text + " OK!");
     }
     else log(RTU_ERROR,text + " NOK!");

     return error;
 }

 /*---------------------------------------------------------------------------
  * Dump all registers, which have been read the last time. The registers can
  * be updated before they are printed.
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::dumpRegisters(bool const updateBefore){

     if (mHoldingRegisters == 0) return -1;

     // update if necessary
     int error = 0;
     if (updateBefore){
        error = updateRegisters();
     }

     mHoldingRegisters->dump();

     return error;
}


 /*---------------------------------------------------------------------------
  * Update all registers of the RTU and save them to the internal registers
  * of this class.
  *--------------------------------------------------------------------------*/
int STM32_VLDISCO::updateRegisters(){

    if (mHoldingRegisters == nullptr) return -1;

    return  readMultiRegister(0,RTU_NUM_HOLDING_REGISTER,mHoldingRegisters);
}


/*---------------------------------------------------------------------------
 * Reset all registers of the RTU.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::resetRegisters(){

    int error = 0;
    for (int i = 0; i<RTU_NUM_HOLDING_REGISTER;i++){
        int error = writeSingleRegister(i,0);
        if (error != RTU_OK){
            // IGNORE ERRORS!
        }
        cout << i << endl;
    }


   // after reset update
   error = updateRegisters();

   return error;
}


/*---------------------------------------------------------------------------
 * Return a register, which was read the last time.
 *--------------------------------------------------------------------------*/
int16_t STM32_VLDISCO::getRegister(uint8_t const reg) const{

    if (reg > RTU_NUM_HOLDING_REGISTER) return RTU_OK;

    int16_t ret = 0;

    if (mHoldingRegisters->getValue(reg,&ret) != MODBUS_OK){
        return RTU_OK;
    }

    return ret;
}


/*---------------------------------------------------------------------------
 * Set a specified bit mask in the RTU's internal register. This function can
 * be used to set a single bit in the register and avoid overwritig existing
 * value.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::setBit(uint8_t const reg, uint16_t const bitMask){

    int16_t value = 0;

    // read register
    int error = readSingleRegister(reg,&value);
    RTUASSERT(error);

    // set bit
    value = value | bitMask;

    // write back register
    error = writeSingleRegister(reg,value);

    return error;
}

/*---------------------------------------------------------------------------
 * Clear a bit mask in the RTU's internal register. This function can be used
 * to reset a single bit in the register and avoid overwriting an existing value.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::clearBit(uint8_t const reg, uint16_t const bitMask){
    int16_t value = 0;

    // read register
    int error = readSingleRegister(reg,&value);
    RTUASSERT(error);

    // set bit
    value = value & ~bitMask;

    // write back register
    error = writeSingleRegister(reg,value);

    return error;
}


/*---------------------------------------------------------------------------
 * Compare a register with a specified value. This function returns RTU_OK
 * when both values match.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::compareRegisterValue(uint8_t const reg, int16_t const value,bool const updateBefore){

    int16_t tmp = 0;

    if (updateBefore){
        int error = readSingleRegister(reg,&tmp);
        RTUASSERT(error);
    }

    // get register value
    tmp =  getRegister(reg);

    // compare values
    if (tmp == value) return RTU_OK;

    return RTU_ERROR_COMPARISON_FAILED;
}

/*---------------------------------------------------------------------------
 * Compare a register with a specified bit mask. This function returns RTU_OK
 * when both values match.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::compareRegisterMask(uint8_t const reg, int16_t const value,bool const updateBefore){

    int16_t tmp = 0;

    if (updateBefore){
        readSingleRegister(reg,&tmp);
    }

    // get register value
    tmp =  getRegister(reg);

    // compare values
    if ((tmp & value) == value) return RTU_OK;

    return RTU_ERROR_COMPARISON_FAILED;
}

/*---------------------------------------------------------------------------
 * Compare a register with a specified bit value. This function returns RTU_OK
 * a specific bit 1 or zero.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::compareRegisterBit(uint8_t const reg, uint16_t const bit,bool const value,bool const updateBefore){

