markusjellitsch/Helio/Sources/Slaves/stm32_vldisco.cpp
    int16_t tmp = 0;

    if (updateBefore){
      int error =   readSingleRegister(reg,&tmp);
      RTUASSERT(error);
    }

    // get register value
    tmp =  getRegister(reg);

    // get bit status
    bool isSet = ((tmp & bit) == bit);

    if (isSet == value) {
        return RTU_OK;
     }

    return RTU_ERROR_COMPARISON_FAILED;
}

/*---------------------------------------------------------------------------
 * Check if a specified register bit is set. In case of a match RTU_OK
 * is returned.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::compareSet(uint8_t const reg, uint16_t const bit){
        return compareRegisterBit(reg,bit,1,true);
}


/*---------------------------------------------------------------------------
 * Check if a specified register bit is zero. In case of a match RTU_OK
 * is returned.
 *--------------------------------------------------------------------------*/
int STM32_VLDISCO::compareZero(uint8_t const reg, uint16_t const bit){
    return compareRegisterBit(reg,bit,0,true);
}



/*---------------------------------------------------------------------------
 * Start PWM signal on a specified channel with a specified period and a
 * specified duty cycle.
 *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::startPWM(uint8_t const channel, uint16_t const period, uint8_t const duty){

    int error = writeSingleRegister(RTU_PWM_CR,0);
    error = clearBit(RTU_SYS_EN,channel);
    RTUASSERT(error);


    error = writeSingleRegister(RTU_PWM_PSC,24);
    RTUASSERT(error);

    error = writeSingleRegister(RTU_PWM_PRD,period);
    RTUASSERT(error);

    error = writeSingleRegister(RTU_PWM_DUT,(uint16_t)duty);
    RTUASSERT(error);

    error = setBit(RTU_SYS_EN,channel);
    RTUASSERT(error);

    error = setBit(RTU_PWM_CR,0);
    RTUASSERT(error);

    return RTU_OK;
 }

 /*---------------------------------------------------------------------------
  * Set PWM Count. This is the total number of PWM pulsed, which are generated
  * by the RTU
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::setPWMCount(uint16_t const count){

    int error = writeSingleRegister(RTU_PWM_CNT,count);
    RTUASSERT(error);

    cout << "Writing to " << RTU_REG_NAME_PWM_CNT << " OK" << endl;
    return RTU_OK;
 }

 /*---------------------------------------------------------------------------
  * Stop PWM singnal of a specified channel
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::stopPWM(uint8_t const channel){
    return clearBit(RTU_SYS_EN,channel);
 }


 /*---------------------------------------------------------------------------
  * Return if a PWM channel is off
  *--------------------------------------------------------------------------*/
 bool STM32_VLDISCO::isPWMOff(uint8_t const channel){

     int enabled = compareSet(RTU_SYS_EN,channel);
     int status = compareSet(RTU_PWM_SR,channel);

     if (enabled == RTU_OK && status == RTU_OK) return true;

     return false;
 }

 int STM32_VLDISCO::setCaptureCount(uint8_t const channel, uint16_t const value){

    int error = -1;

    switch (channel){

        case RTU_CNT_CHANNEL1:
            error = writeSingleRegister(RTU_CNT_CH1,value);
            break;

        case RTU_CNT_CHANNEL2:
            error = writeSingleRegister(RTU_CNT_CH2,value);
            break;

        case RTU_CNT_CHANNEL3:
            error = writeSingleRegister(RTU_CNT_CH3,value);
            break;

        case RTU_CNT_CHANNEL4:
            error = writeSingleRegister(RTU_CNT_CH4,value);
            break;

        default:
            break;
    }

    RTUASSERT(error);

    return RTU_OK;
 }

 int STM32_VLDISCO::setCaptureResolution(uint16_t const resolution){

     int error = writeSingleRegister(RTU_CNT_RES,resolution);
     RTUASSERT(error);

     return RTU_OK;
 }

int STM32_VLDISCO::startCapture(uint8_t const channel){

    int error = setBit(RTU_SYS_EN,channel);
    RTUASSERT(error);

    error = compareSet(RTU_SYS_EN,channel);
    RTUASSERT(error);

    return RTU_OK;
}

int STM32_VLDISCO::stopCapture(uint8_t const channel){

    int error = clearBit(RTU_SYS_EN,channel);
    RTUASSERT(error);

    return RTU_OK;
}

bool STM32_VLDISCO::isCaptureFinished(uint8_t const channel){

    int error = writeSingleRegister(RTU_CNT_SR,channel>>4);
    if (error != RTU_OK) return false;

    error = compareZero(RTU_CNT_SR,channel>>4);
    if (error != RTU_OK) return false;

    return true;
}

int STM32_VLDISCO::getFrequency(uint8_t const channel,uint16_t * value){

    if (value == nullptr) return RTU_ERROR_NULLPTR;

    // writing to status register will wr
    int error = writeSingleRegister(RTU_CNT_PRD,channel>>4);
    RTUASSERT(error);

    int16_t period = 0;
    error = readSingleRegister(RTU_CNT_PRD,&period);
    RTUASSERT(error);

    // calculate frequency
    *value = period;
    return RTU_OK;
}

 /*---------------------------------------------------------------------------
  * Return Statistic
  *--------------------------------------------------------------------------*/
 RTUStatistic STM32_VLDISCO::getStatistic() const{
     return mStatistic;
 }

 /*---------------------------------------------------------------------------
  * Print Statistic
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::printStatistic() const{

     SPIConfig_t spiConfig = mSPIInterface->getConfig();

     cout << left;
     cout << setw(35) << setfill('-') << "-" << setfill(' ')<< endl;
     cout << setw(35) << "RTU Statistic" << endl;
     cout << setw(35) << setfill('-') << "-" << setfill(' ') << endl;

     cout << setw(30) << "SPI Device" << ":" << spiConfig.deviceName << endl;
     cout << setw(30) << "SPI CLK Speed" << ":" << spiConfig.busSpeed << endl;
     cout << setw(30) << "Modbus packets sent" << ":" << mStatistic.commandsSent << endl;
     cout << setw(30) << "Timouts occured" << ":" << mStatistic.timeoutsOccured << endl;
     cout << setw(30) << "Modbus reponses received" << ":" << mStatistic.responsesReceived << endl;
     cout << setw(30) << "Modbus errors received" << ":" << mStatistic.errorsOccured << endl;
     cout << setw(30) << "Error rate (%)" <<":"<< ((double)mStatistic.errorsOccured +(double)mStatistic.timeoutsOccured) / (double)mStatistic.commandsSent * 100 << endl;
     return RTU_OK;
 }

