markusjellitsch/Helio/Sources/Slaves/stm32_vldisco.cpp
 /*---------------------------------------------------------------------------
  * Move Terminal Cursor Up
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::setTerminalCursorBack(uint8_t const num)const{

     // set cursor to the beginning
     for (size_t i = 0; i<num; i++){
          cout << "\x1b[A";
     }

     return RTU_OK;
 }


 /*---------------------------------------------------------------------------
  * Start stopwatch
  *--------------------------------------------------------------------------*/
 int STM32_VLDISCO::startTimer(){

     mStopwatchCounter = getTime();

     return RTU_OK;
 }

 /*---------------------------------------------------------------------------
  * Start stopwatch
  *--------------------------------------------------------------------------*/
 double STM32_VLDISCO::stopTimer(){


     if (mStopwatchCounter == 0){
            return 0;
     }


     double elapsed = getElapsed();

     mStopwatchCounter = 0;

     return (elapsed);
 }

 /*---------------------------------------------------------------------------
  * Get stopwatch time
  *--------------------------------------------------------------------------*/
 double STM32_VLDISCO::getTime(){

     struct timespec ts;
     clock_gettime(CLOCK_MONOTONIC,&ts);


     // calculate elapsed time
     uint64_t now = (uint64_t)ts.tv_sec * 1000000000U +(uint64_t)ts.tv_nsec;

     return (double)now;
 }

 /*---------------------------------------------------------------------------
  * Get elapsed time
  *--------------------------------------------------------------------------*/
 double STM32_VLDISCO::getElapsed(){

     // calculate elapsed time
     uint64_t elapsed = (getTime() - mStopwatchCounter) / 1000000;
     return elapsed;
 }

 void STM32_VLDISCO::delayMilliseconds(uint16_t const milliseconds){

     double start = getTime();
     double elapsed = 0;

     while (elapsed <= milliseconds){
         elapsed = (getTime() - start) / 1000000;
     }
 }


int STM32_VLDISCO::assertHandler(int errorCode,string const & file, int line){

    string text = "ASSERT FAILED IN";
    text.append(file);
    text.append(" IN LINE ");
    text.append(to_string(line));
    text.append(".ERROR CODE:"+ errorCode);
    log(RTU_ERROR,text);

    return RTU_OK;
}















